# -*- coding: utf-8 -*-
"""
Created on Tue Apr 12 18:39:22 2022

@author: watson
"""

print(1,"A",True,3.14)

#字串格式化
# %d s f 特殊字符 
# %d  整數    %s 字串   %f 浮點數
print("今天有%d人，一起劃圓，圓半徑為%f" % (50,5.67) )
# 最少的長度要是三個，可以多，若少時，就會補上空白
print("分數：%3d分" % (70))
print("分數：%3d分" % (100))
print("分數：%3d分" % (7))
print("分數：%3d分" % (1200))
print("利率：%.2f" % (3.1215926))
print("利率：%.3f" % (3.1215926))
# %5.2f 表示：長度最少五個(含 .) ，不足時補空白
print("利率：%5.2f" % (3.1215926))

print("%s" % ("Hello")) 
print("%20s" % ("Hello")) #向右對齊

print("%-20s" % ("Hello")) #向左對齊


